[
  {
    "number": 36,
    "name": "Avengers: Infinity war (Full)",
    "description": "Everything comes to a head in this universe-shattering event. The Mad Titan Thanos arrives to collect all six Infinity Stones, forcing the Avengers, Guardians of the Galaxy, and allies to make heartbreaking sacrifices. The film that redefined superhero storytelling (Full HD with English subtitles).",
    "link": "/maintenance"
  },
  {
    "number": 35,
    "name": "Avengers: Endgame (Full)",
    "description": "Movie - The full high-definition version of Avengers: Endgame, the epic conclusion to the Infinity Saga. This 2019 superhero film, produced by Marvel Studios and directed by the Russo brothers, features Earth's mightiest heroes as they attempt to reverse the damage caused by Thanos. Includes all post-credit scenes and bonus content. File format: MP4 (1080p).",
    "link": "https://mega.co.nz/#!2fgC1YrQ!HNdxXxFEUwqLXdVvE5uJK2WhvENYbGaUou00uS9F5Oo"
  },
  {
    "number": 34,
    "name": "FLOW Movie (Full)",
    "description": "Movie - The complete full-length version of FLOW, a critically acclaimed animated film inspired by the Studio Ghibli aesthetic. This environmental-themed adventure follows a young girl who discovers a magical connection to water and embarks on a journey to restore balance to nature. Includes English subtitles and original Japanese audio. File format: MP4 (1080p).",
    "link": "https://mega.co.nz/#!nbJGzBKK!e4-MGG3zP23IUJpjhV9RLlQJoJhxfp5eoWGSVYonO7I"
  },
  {
    "number": 33,
    "name": "MEGAsync (bundled for Arch Linux)(I use Arch btw)",
    "description": "Software - A pre-configured ZIP archive of MEGAsync, the official synchronization client for MEGA cloud storage, specifically bundled for Arch Linux systems. Includes all dependencies and installation scripts. Perfect for users who want seamless integration with MEGA's encrypted cloud storage on Arch. Version: 4.9.3.",
    "link": "https://mega.nz/file/gM5nxLiD#UmCkkoVyYMQHS9fzrCRRoqoO6uskXfwsLP6wSvDY8B4"
  },
  {
    "number": 32,
    "name": "The Laws of Human Nature PDF: Mastering Human Behavior",
    "description": "Book (PDF) - Robert Greene's comprehensive guide to understanding human psychology and social dynamics. This 624-page masterpiece explores 18 fundamental laws of behavior, combining historical examples with practical advice for personal and professional success. Topics include emotional intelligence, manipulation, and self-mastery. Scanned in high quality with OCR for text search.",
    "link": "https://mega.nz/file/xJwTzAZD#QP259EJXrm5nwDKkBxCG9vbtnBtHQZkmYSZ81p6wUQc"
  },
  {
    "number": 31,
    "name": "Percy Jackson PDF: A Modern Mythology Masterpiece",
    "description": "Book (PDF) - The complete Percy Jackson & the Olympians series by Rick Riordan, including all five novels and supplementary materials. This bundle features high-quality scans of the beloved young adult fantasy series that blends Greek mythology with modern adventure. Perfect for fans of demigods, quests, and witty storytelling. File includes bookmarks for easy navigation.",
    "link": "https://mega.nz/file/JVBQkJDC#nHMxpvJr0F1w8FPy7d9OG7Z9yuq5z820sw_YZvHCt-s"
  },
  {
    "number": 30,
    "name": "Waiting for Godot PDF: A Tragicomedy in Two Acts (Beckett, Samuel)",
    "description": "Book (PDF) - Samuel Beckett's iconic absurdist play 'Waiting for Godot' in its entirety. This edition includes the original 1952 text, critical analysis, and production notes. A must-read for theater enthusiasts and literature students exploring existential themes. File contains clear typography and preserved page formatting from the Grove Press edition.",
    "link": "https://mega.nz/file/RQgSxCJB#tST-PiZ6L36oolZtrclpFu-Nsy3G1nkJ1SkHeVk0VV8"
  },
  {
    "number": 29,
    "name": "48 Laws of Power PDF by Robert Greene",
    "description": "Book (PDF) - Robert Greene's controversial bestseller 'The 48 Laws of Power,' a modern Machiavellian guide to social influence and strategy. This 452-page volume distills 3,000 years of power dynamics into actionable principles, featuring historical case studies from figures like Sun Tzu and Talleyrand. Includes the complete annotated text with index.",
    "link": "https://mega.nz/file/UNIAmTYR#aKzkckf0x7i7xMq_MVFyFGFeBMKEWz_FePW9-S_trfA"
  },
  {
    "number": 28,
    "name": "Dragonlance Shadow of the Dragon Queen PDF",
    "description": "Book (PDF) - The official campaign module for Dungeons & Dragons 5th Edition set in the Dragonlance universe. This 224-page adventure features the War of the Lance storyline, complete with maps, NPCs, and rules for large-scale battles. Includes high-resolution scans of all artwork and tables. Perfect for DMs looking to run a classic fantasy campaign.",
    "link": "https://mega.nz/file/9Bp0EbhS#PuIfr4C5k1V2JC-53fAgVJ-LbNxs_zB8n60spIyOsls"
  },
  {
    "number": 27,
    "name": "Can't Hurt Me PDF: Master Your Mind and Defy the Odds",
    "description": "Book (PDF) - David Goggins' brutal autobiography and self-improvement manifesto 'Can't Hurt Me.' This unflinching account details Goggins' transformation from overweight exterminator to Navy SEAL and ultramarathon runner, paired with challenging 'Accountability Mirror' exercises. The file includes the complete text with all motivational callouts and training regimens.",
    "link": "https://mega.nz/file/cEQSFYwK#M2wlnwTNK5b5i7rY6ZreXCizFZwSIwR8NGDZQqvkp7A"
  },
  {
    "number": 26,
    "name": "Cuphead (full + repack)",
    "description": "Game (Windows) - A repackaged version of Cuphead, the critically acclaimed run-and-gun indie game inspired by 1930s cartoons. This version includes all DLCs, compressed without quality loss (from 15GB to 4GB). Features the complete soundtrack, all boss fights, and local co-op mode. Just extract and play—no installation required. Version: 1.3.4.",
    "link": "https://mega.nz/file/GQFQgQxa#JakeflmZOqNGTENpwpKT2DBOWxO1azc6dqA2xf3W3Vs"
  },
  {
    "number": 25,
    "name": "Stardew Valley (full + repack + high compress)",
    "description": "Game (Windows) - A highly compressed repack of Stardew Valley (v1.5.6), the beloved farming simulation RPG. This version reduces the install size by 60% while retaining all features: marriage candidates, mining, fishing, and multiplayer support. Includes the 'Secret Notes' update and auto-installs necessary dependencies. Perfect for low-end PCs.",
    "link": "https://mega.nz/file/ZMo30AQA#jJ3U--3OaPyt1QoEJ_w88ogbSeI1qenmGZ-sC9SVbKc"
  },
  {
    "number": 24,
    "name": "Katana ZERO (full + repack + high compress)",
    "description": "Game (Windows) - A compressed repack of Katana ZERO, the neo-noir action platformer with time manipulation mechanics. This version includes all patches and the alternate soundtrack DLC. Reduced from 3GB to 800MB without compromising the game's stylish pixel art or fluid combat. Just unzip and launch—no installation needed.",
    "link": "https://mega.nz/file/tcwkQCYI#yjS0Rw1t7n8wEi9Sn7ZehxIHS3zonB55I2-iPt1MTl8"
  },
  {
    "number": 23,
    "name": "Undertale (full + repack + high compress)",
    "description": "Game (Windows) - Toby Fox's Undertale in a tiny 120MB repack (original: 200MB). This version preserves all routes (Pacifist/Neutral/Genocide), the full soundtrack, and hidden secrets. Includes the 'Dog Shrine' update and runs on any PC. The repack uses LZMA compression for faster loading times. Plug-and-play—no DRM or launchers.",
    "link": "https://mega.nz/file/8AwmDJab#u3tRIXeHRZF1Kt5b_4XLs4AQw1_wV2Xpu_4ow7OVb64"
  },
  {
    "number": 22,
    "name": "GTA San Andreas (full + repack + high compress)",
    "description": "Game (Windows) - A highly compressed (800MB) repack of Grand Theft Auto: San Andreas (v1.0). Includes all original radio stations, missions, and the open-world map. This portable version runs on modern Windows systems without compatibility issues. Features the definitive edition's widescreen support and improved draw distance. Just extract and play.",
    "link": "https://mega.nz/file/dU4hnYjZ#LrzCT9TI4w5aCIyVbnecTyI9H5Q0I2mMJRwGE8irqfo"
  },
  {
    "number": 21,
    "name": "Height Maxxing Guide PDF",
    "description": "Book (PDF) - A comprehensive 150-page guide on height enhancement techniques, covering nutrition (vitamin D3/K2 protocols), posture correction, low-intensity spinal decompression, and sleep optimization. Includes scientific studies on growth plate stimulation, supplement stacks, and exercises to maximize genetic potential. Compiled from medical journals and height forums.",
    "link": "https://mega.nz/file/FcpgVD7L#TKEBlSaCLkFaV4xXnt9-kAuFXb2xmkdB49RyD3L9mcg"
  },
  {
    "number": 20,
    "name": "Perfect EQ (EasyEffects Preset)",
    "description": "Audio Tool - A JSON preset file for EasyEffects (Linux) that delivers studio-grade audio equalization. This configuration mimics Harman target curves with adjustments for vocal clarity (3kHz boost) and sub-bass extension (+6dB at 40Hz). Ideal for music production, gaming, and audiophiles. Includes profiles for headphones (HD600, DT990) and speakers.",
    "link": "https://mega.nz/file/lUQVQIKB#OwGQNBZd_Fk3kSwQ_ohwKDuyxJuKPDl0HsGhZlWxHMw"
  },
  {
    "number": 19,
    "name": "Dolby Style (EasyEffects Preset)",
    "description": "Audio Tool - A Dolby Atmos-inspired preset for EasyEffects that creates cinematic surround sound on stereo systems. Emulates Dolby's midrange scoop and dynamic range compression with IRC algorithms. Perfect for movies—enhances dialogue while maintaining explosive bass. Includes calibration instructions for different room acoustics.",
    "link": "https://mega.nz/file/wU51WYbJ#k3q97oVcyQwkdY7PvqOm4ogVOUyyixxyoL_Xy5WHoBg"
  },
  {
    "number": 18,
    "name": "Bass Boost (EasyEffects Preset)",
    "description": "Audio Tool - An aggressive bass enhancement preset for EasyEffects with adjustable parameters. Features a low-shelf filter (+12dB at 80Hz), harmonic exciter, and dynamic EQ to prevent distortion. Designed for EDM and hip-hop enthusiasts. Includes safe limits for different driver types (planar magnetic vs dynamic).",
    "link": "https://mega.nz/file/hRgyVKKT#xeM-0BjgLMpPphE5-MaC4RNtNLYJ8qqQCpZmaH7KLSo"
  },
  {
    "number": 17,
    "name": "Zero to One",
    "description": "Book (PDF) - Peter Thiel's 'Zero to One: Notes on Startups, or How to Build the Future,' a Silicon Valley classic on innovation and monopoly theory. This 224-page text argues that true progress comes from vertical innovation (0→1) rather than globalization (1→n). Includes Thiel's contrarian business philosophies and case studies from PayPal to Palantir.",
    "link": "https://mega.nz/file/ZcQyWbDS#_XT7NjWY7yiuoZmIaIYYx8yRZMJa2dpD402g8Bnp2-I"
  },
  {
    "number": 16,
    "name": "Steal Like an Artist",
    "description": "Book (PDF) - Austin Kleon's 'Steal Like an Artist: 10 Things Nobody Told You About Being Creative.' This illustrated guide dispels originality myths and teaches ethical 'theft' from artistic influences. Covers workflow hacks, side projects, and creative authenticity. File includes the author's hand-drawn diagrams in high resolution.",
    "link": "https://mega.nz/file/FNwGHJKZ#r9X1RkfbaDfH7pXLZWU0pIM5GlPHBNrarNuRS5cVzgk"
  },
  {
    "number": 15,
    "name": "Psychology of Money",
    "description": "Book (PDF) - Morgan Housel's 'The Psychology of Money: Timeless Lessons on Wealth, Greed, and Happiness.' Through 19 short stories, this finance book explores behavioral economics concepts like 'tail events' and compounding. Focuses on the soft skills behind financial success rather than spreadsheet tactics. Includes annotated examples from Warren Buffett to Ronald Read.",
    "link": "https://mega.nz/file/wUAEADiA#E1ck3uOKM-qfZw0Lr-hRTfxlFnEFyu-ykbg_VLLzock"
  },
  {
    "number": 14,
    "name": "Arch Linux Guidebook / handbook",
    "description": "Book (PDF) - A 300-page comprehensive manual for Arch Linux users, covering installation (including UEFI/LUKS), pacman optimization, systemd-nspawn containers, and kernel compilation. Updated for 2024 with sections on Secure Boot, Btrfs snapshots, and Wayland troubleshooting. Written in clear, no-nonsense prose with troubleshooting flowcharts.",
    "link": "https://mega.nz/file/pRRliBgS#SxL7ngN7zKeM8V793OKe7ceKMJ_YbF5u5LG3AAv3D-k"
  },
  {
    "number": 13,
    "name": "Linux Guidebook / handbook",
    "description": "Book (PDF) - A 450-page omnibus on Linux system administration, from Bash scripting (with AWK/Sed) to KVM virtualization. Covers distro-agnostic topics like journalctl debugging, firewalld zones, and Ansible automation. Special chapters on recovering broken GRUB and forensic analysis with The Sleuth Kit. Perfect for RHCSA/LPIC exam prep.",
    "link": "https://mega.nz/file/8RZXhTBC#IVh9K9wtZuow6c8dw9JGGkPJOclW06wA90B-7StIRRA"
  },
  {
    "number": 12,
    "name": "TLaucher (Bundled + Ready to use)(For Linux 64 bit)",
    "description": "Software - A preconfigured TLauncher package for Linux (x86_64) that lets you play Minecraft Java Edition with mod/version management. Includes bundled Java 17, optimized JVM flags for AMD/NVIDIA GPUs, and preinstalled performance mods (Sodium, Lithium). Auto-updates modpacks like FTB and RLcraft. Just extract and run the launcher script.",
    "link": "https://mega.nz/file/tNIyzSzY#d2-3jGLpiyCTB0D1EWJnR00givowd1s0jWJtkXsAZpM"
  },
  {
    "number": 11,
    "name": "The Art of Invisibility - The World's Most Famous Hacker Teaches You How to Be Safe in the Age of Big Brother and Big Data by Kevin Mitnick",
    "description": "Book (PDF) - Kevin Mitnick's guide to operational security in the digital age. Covers advanced topics: burner device protocols, OPSEC for journalists, cryptocurrency anonymization (CoinJoin), and defeating facial recognition. Includes real-world case studies of surveillance overreach. The PDF has clickable references to Tor hidden services for further reading.",
    "link": "https://mega.nz/file/gBxgmZ4Y#_fEaXReV1ApJr8Fxwsepe1wUEvWBJCw4UAcuEUNWT_M"
  },
  {
    "number": 10,
    "name": "metasploit_a penetration testers guide.pdf",
    "description": "Book (PDF) - The definitive 600-page guide to Metasploit Framework for ethical hacking. Covers exploit development (from fuzzing to ROP chains), post-exploitation modules (Mimikatz integration), and evasion techniques (AMSI bypass). Updated for Metasploit 6 with chapters on cloud penetration testing (AWS/Azure) and IoT device exploitation.",
    "link": "https://mega.nz/file/dUg2VagZ#xL7XS8FnmYnWwsapOvR256U6LEibDQxW8NRwdisdU5I"
  },
  {
    "number": 9,
    "name": "Black Hat Python - Python Programming for Hackers and Pentesters by Justin Seitz.pdf",
    "description": "Book (PDF) - Justin Seitz's guide to offensive Python programming. Teaches network sniffing (Scapy), credential harvesting (keyloggers with pyxhook), and malware persistence (registry hooks). Updated for Python 3 with new chapters on exploit chain automation (from CVE research to weaponization) and bypassing EDR solutions. Code samples included as separate .py files.",
    "link": "https://mega.nz/file/gVw10IyQ#TKbEGEmR0DsxlxLGMDj9lbZKN5dG9_hZe-WC0mGRU0U"
  },
  {
    "number": 8,
    "name": "Hacking The Art Of Exploitation.pdf",
    "description": "Book (PDF) - Jon Erickson's seminal work on hacking techniques, now with 2024 annotations. Combines C programming deep dives (buffer overflow to ROP gadgets) with practical reverse engineering (GDB/Radare2). Includes a virtual machine image for hands-on exploit development against deliberately vulnerable binaries. The PDF has interactive assembly code visualizations.",
    "link": "https://mega.nz/file/UIxyzI4a#5SwBDWl2j9JwYcNNpabRUSf9tZshUsOhZxxXIjR4_vc"
  },
  {
    "number": 7,
    "name": "HappyMod-3-1-5.apk",
    "description": "Android App - HappyMod v3.1.5, a third-party Android app store specializing in modded APKs (games and apps with premium features unlocked). This version removes ads and includes pre-patched certificates for easier installation. Warning: Use only on non-rooted devices with caution, as modded APKs may violate app terms of service.",
    "link": "https://mega.nz/file/tU5CXbyQ#HbecF18H-kszMtPz8CqXBc8t6QVCgyLvk1qSWOxeE44"
  },
  {
    "number": 6,
    "name": "minecraft-1-21-80-28.apk",
    "description": "Game (Android) - Minecraft Bedrock Edition v1.21.80.28 APK, compatible with Android 9+. Includes the 'Tricky Trials' update with new mobs (breeze), trial chambers, and the mace weapon. No modifications—this is the official APK with Xbox Live integration. Works on Chromebooks with Google Play support. SHA-256 verified.",
    "link": "https://mega.nz/file/gN5GzbiQ#UDq5OZwLFmCLsdTywcJxaNlvb-I-vqtuNAqoVLFPPSY"
  },
  {
    "number": 5,
    "name": "minecraft-1-21-72.apk",
    "description": "Game (Android) - Minecraft Bedrock Edition v1.21.72 APK, a stable release before the Tricky Trials update. Preserved for users experiencing bugs in newer versions. Features include the crafter block and armor trims. Compatible with Realms and cross-play with Windows/iOS. Includes ARMv7 and ARM64 binaries.",
    "link": "https://mega.nz/file/kRhhCJQY#eRy6BO8rT4JkAIqiJL66MIc5ecA0i6KkXr_CEZnheu0"
  },
  {
    "number": 4,
    "name": "Block Blast! Mod Apk v6.8.7 (Unlimited Money)",
    "description": "Game (Android) - A modified version of Block Blast! Adventure Master with unlimited coins and all premium puzzles unlocked. This puzzle game challenges players to clear blocks strategically while avoiding gridlock. The mod removes ads and bypasses energy timers. Note: May not work with Google Play Games login. Use in airplane mode to prevent detection.",
    "link": "https://mega.nz/file/NMwDVBKQ#UEerI1rYtrkBTnIsRHyajIcw-Rh8yFV3LJLrh3A_rdI"
  },
  {
    "number": 3,
    "name": "Guide to Computer Forensics and Investigations 5th Edition eBook",
    "description": "Book (PDF) - The 5th edition of this academic textbook on digital forensics, covering chain of custody procedures, NTFS artifact analysis (USN journal), and memory forensics with Volatility. Includes case studies on ransomware analysis and IoT device取证. Used in CISSP and CCE certification courses. Searchable PDF with highlighted key terms.",
    "link": "https://mega.nz/file/hdJTCL4L#CorKjy7D-OsBUowEyJc615BkCvBOQzh_EDG9F364QLo"
  },
  {
    "number": 2,
    "name": "Visual Studio Code Installer",
    "description": "Software - A portable installer for Visual Studio Code (v1.89), Microsoft's lightweight code editor. This package includes essential extensions (Python IntelliSense, Docker, ESLint) and preconfigured settings for web development (auto-format on save, live server). Works without admin rights—extracts to any folder. Also includes the VS Code CLI for remote development.",
    "link": "https://mega.nz/file/VNJFBALJ#tX6y1k35x7XMLPEjsOEKQGNsawv-O5wB0vhF22F20Zw"
  },
  {
    "number": 1,
    "name": "7-Zip Portable",
    "description": "Software - A portable version of 7-Zip v23.01, the open-source file archiver with superior compression ratios (especially LZMA2). This standalone executable runs from USB drives and includes context menu integration (optional). Supports extraction of 50+ formats (RAR5, DMG) and creation of self-extracting archives. Digital signature verified.",
    "link": "https://mega.nz/file/ZNBhwChS#xwsigc63qS7FfUnhsRIOu05i3JsKh300VrvZmL5hyBc"
  }
]