[
  {
    "number": 37,
    "name": "Avengers: Age of Ultron (2015) [Full Movie]",
    "description": "When Tony Stark and Bruce Banner accidentally create Ultron, an AI meant to bring peace, things go horribly wrong. Ultron decides humanity is the real threat and sets out to destroy the world. Now, the Avengers must reunite and face their biggest challenge yet. With new allies like Vision and Scarlet Witch, they’ll have to battle not just Ultron, but their own fears and doubts. It’s an action-packed rollercoaster of epic battles, surprising twists, and a lot of heart. Will they be able to stop Ultron before it’s too late?",
    "link": "/maintenance.html"
  },
  {
    "number": 36,
    "name": "Avengers: Infinity War (Full HD with English Subtitles)",
    "description": "Experience the cinematic event that changed the Marvel Cinematic Universe forever. 'Avengers: Infinity War' brings together Earth's mightiest heroes and the Guardians of the Galaxy in a desperate battle against the genocidal warlord Thanos. This high-stakes adventure spans the cosmos as heroes from every corner of the Marvel universe unite to prevent Thanos from collecting all six Infinity Stones. Witness heartbreaking sacrifices, shocking twists, and unprecedented teamwork in this 2018 blockbuster that redefined superhero storytelling. The full HD version includes crisp 1080p resolution, 5.1 surround sound, and accurate English subtitles. Runtime: 149 minutes. File format: MKV (H.264 codec). Includes all post-credit scenes and Marvel title sequences.",
    "link": "https://mega.co.nz/#!nAEXlBTT!LazAuR-8q0gXJqTneDhiKCkt7k01AkTXCD6VOQC1ggg"
  },
  {
    "number": 35,
    "name": "Avengers: Endgame (Complete Ultimate Edition)",
    "description": "The epic conclusion to Marvel's Infinity Saga arrives in this comprehensive edition of 'Avengers: Endgame.' Following the devastating events of Infinity War, the surviving Avengers must devise an ambitious plan to reverse Thanos' catastrophic snap. This 2019 superhero masterpiece features time travel, emotional reunions, and the largest battle sequence in MCU history. The Ultimate Edition includes: the full theatrical cut (181 minutes) in pristine 1080p, IMAX enhanced aspect ratio for key sequences, director's commentary track, all three post-credit scenes, and the special 'Avenge the Fallen' tribute. Perfect for MCU collectors and fans who want to relive Captain America's iconic moment with Mjolnir or Tony Stark's ultimate sacrifice in the highest quality possible.",
    "link": "https://mega.co.nz/#!2fgC1YrQ!HNdxXxFEUwqLXdVvE5uJK2WhvENYbGaUou00uS9F5Oo"
  },
  {
    "number": 34,
    "name": "FLOW (2022) - Full Animated Film",
    "description": "Dive into the silent, post-apocalyptic world of 'FLOW,' a groundbreaking animated feature from Latvian director Gints Zilbalodis. This visually stunning film follows a group of animals—led by a resilient black cat—navigating a flooded Earth where gravity has collapsed, and water flows in mesmerizing, impossible patterns. Entirely without dialogue, the story unfolds through breathtaking 3D animation, blending minimalist art with physics-defying environmental storytelling. The film's unique aesthetic (inspired by Latvian folklore and Studio Ghibli's atmospheric worlds) explores themes of survival, ecological balance, and interspecies connection. This edition includes: the full 82-minute feature in 1080p with HDR color grading, director's commentary on the 4-year solo production process, and a bonus documentary about the innovative 'virtual camera' techniques used to simulate fluid dynamics. Awards: Contrechamp Prize at Annecy Animation Festival (2022). Perfect for fans of 'The Red Turtle,' 'Angel's Egg,' or experimental animation.",
    "link": "https://mega.co.nz/#!nbJGzBKK!e4-MGG3zP23IUJpjhV9RLlQJoJhxfp5eoWGSVYonO7I"
  },
  {
    "number": 33,
    "name": "MEGAsync for Arch Linux (Pre-Configured Bundle)",
    "description": "Optimized specifically for Arch Linux users, this pre-configured MEGAsync package includes everything needed for seamless cloud synchronization. The bundle features: the latest MEGAsync client (v4.9.3) compiled for x86_64 architectures, all required dependencies (qt5-base, libuv, cryptopp), systemd service files for auto-start, and a custom PKGBUILD for easy Arch User Repository integration. Also includes a bash script that automatically configures mount points for MEGA's encrypted virtual filesystem and sets up bandwidth throttling rules. The installation guide covers advanced topics like: compiling from source with -march=native optimizations, integrating with Dolphin/KDE, and troubleshooting common certificate errors on Arch-based distributions.",
    "link": "https://mega.nz/file/gM5nxLiD#UmCkkoVyYMQHS9fzrCRRoqoO6uskXfwsLP6wSvDY8B4"
  },
  {
    "number": 32,
    "name": "The Laws of Human Nature by Robert Greene (Definitive Edition)",
    "description": "Robert Greene's magnum opus on human psychology and social dynamics, now in an enhanced digital edition. This 624-page masterpiece systematically explores 18 fundamental laws governing human behavior, from 'The Law of Irrationality' to 'The Law of Generational Myopia.' The definitive edition includes: historical case studies spanning from Ancient Greece to Silicon Valley, practical exercises for developing emotional intelligence, and Greene's famous 'Reversal' sections that teach how to defend against manipulative behavior. The PDF features: OCR-scanned text for highlighting/note-taking, interactive table of contents with direct chapter links, high-resolution reproductions of the book's diagrams and illustrations, and a bonus appendix with 50 additional psychological patterns not found in the print version. Essential reading for leaders, negotiators, and students of human nature.",
    "link": "https://mega.nz/file/xJwTzAZD#QP259EJXrm5nwDKkBxCG9vbtnBtHQZkmYSZ81p6wUQc"
  },
  {
    "number": 31,
    "name": "Percy Jackson Complete Series (Illustrated Collector's Edition)",
    "description": "The entire Percy Jackson & the Olympians saga in one comprehensive digital collection. This deluxe edition contains all five original novels (The Lightning Thief through The Last Olympian) plus: the companion guide 'The Demigod Files,' Rick Riordan's short story collection 'The Singer of Apollo,' and never-before-published author annotations. The PDF features: high-quality scans of the original first edition covers, illustrated character profiles by series artist John Rocco, interactive chapter navigation, and a searchable glossary of Greek mythology terms. Special bonus: Includes the controversial 'Percy Jackson and the Stolen Chariot' screenplay draft that was never produced. Formatted for comfortable reading on tablets, e-ink readers, and desktop monitors with adjustable font sizes and night mode support.",
    "link": "https://mega.nz/file/JVBQkJDC#nHMxpvJr0F1w8FPy7d9OG7Z9yuq5z820sw_YZvHCt-s"
  },
  {
    "number": 30,
    "name": "Waiting for Godot: Critical Annotated Edition (Samuel Beckett)",
    "description": "The definitive digital edition of Samuel Beckett's groundbreaking absurdist play, featuring the original 1952 text alongside modern scholarly analysis. This version includes: line-by-line annotations explaining existential themes and theatrical techniques, comparative essays on notable productions (from Patrick Stewart to Ian McKellen), and Beckett's rarely seen rehearsal notes. The PDF replicates the typography of the original Grove Press edition while adding interactive elements: clickable footnotes, embedded audio clips of key monologues, and a timeline tracing the play's influence on postmodern literature. Perfect for theater students, directors preparing productions, or readers grappling with questions of meaning and human connection in a seemingly indifferent universe.",
    "link": "https://mega.nz/file/RQgSxCJB#tST-PiZ6L36oolZtrclpFu-Nsy3G1nkJ1SkHeVk0VV8"
  },
  {
    "number": 29,
    "name": "The 48 Laws of Power: Expanded and Revised (Robert Greene)",
    "description": "The complete and uncensored guide to power dynamics, now with 100+ additional historical examples not found in the original print run. Greene's controversial classic examines strategies used by figures from Cleopatra to Rockefeller, distilled into 48 immutable laws. This edition features: new commentary on applying the laws in digital-age contexts (social media manipulation, algorithmic influence), psychological studies validating each principle, and a 'Counterplay' section teaching defense against each tactic. The PDF includes: redrawn strategy diagrams, a power assessment questionnaire, and case studies from modern tech moguls. Warning: This book's ruthless pragmatism has made it required reading in Wall Street and Silicon Valley—handle its lessons with ethical consideration.",
    "link": "https://mega.nz/file/UNIAmTYR#aKzkckf0x7i7xMq_MVFyFGFeBMKEWz_FePW9-S_trfA"
  },
  {
    "number": 28,
    "name": "Dragonlance: Shadow of the Dragon Queen (D&D 5E Campaign)",
    "description": "The official Dungeons & Dragons 5th Edition campaign set in the beloved Dragonlance universe. This meticulously scanned 224-page module includes: the complete War of the Lance storyline (levels 1-11), 30+ battle maps with grid overlays, and rules for large-scale warfare mechanics. Digital enhancements: hyperlinked stat blocks for all NPCs, editable character sheets for key figures like Tanis Half-Elven, and a JavaScript dice roller for the included solo scenarios. Also contains the controversial 'Soth's Redemption' alternate ending excised from early print runs. Perfect for Dungeon Masters seeking to recreate the epic feel of Weis & Hickman's novels, with guidance for adapting the campaign to Eberron or Forgotten Realms settings.",
    "link": "https://mega.nz/file/9Bp0EbhS#PuIfr4C5k1V2JC-53fAgVJ-LbNxs_zB8n60spIyOsls"
  },
  {
    "number": 27,
    "name": "Can't Hurt Me: Ultimate Mental Toughness Guide (David Goggins)",
    "description": "David Goggins' brutal autobiography and self-improvement system in an enhanced digital format. Beyond the printed book's content, this edition includes: the complete '40% Rule' workout plans (Navy SEAL Hell Week simulations), uncensored interview transcripts about Goggins' childhood trauma, and downloadable 'Accountability Mirror' templates. The PDF features: embedded video clips of Goggins' most intense training sessions, interactive progress trackers for the 30-day mental challenges, and a bonus chapter on applying his methods to entrepreneurial pursuits. Warning: Not for the faint-hearted—this is the playbook used by elite athletes and special forces operators to transcend perceived human limits. Includes the controversial 'Sleep Deprivation Protocol' removed from some international editions.",
    "link": "https://mega.nz/file/cEQSFYwK#M2wlnwTNK5b5i7rY6ZreXCizFZwSIwR8NGDZQqvkp7A"
  },
  {
    "number": 26,
    "name": "Cuphead: The Delicious Last Course (Complete Repack)",
    "description": "The complete Cuphead experience in a highly optimized 4GB repack (original: 15GB). Includes: the base game, all DLCs (featuring Ms. Chalice as a playable character), and the soundtrack (200+ tracks of original jazz recordings). Technical enhancements: Vulkan API support for Linux/Steam Deck, unlocked framerate (up to 240FPS), and optional CRT filter for authentic 1930s cartoon visuals. The repack preserves all content: 30+ hand-animated boss fights, co-op mode, and the hidden King's Leap platforming challenges. Installation includes a configuration wizard for difficulty presets—from 'Simple' for animation fans to 'Expert' for masochists chasing S-ranks. All files CRC-verified to ensure no corruption of the game's frame-perfect animation cycles.",
    "link": "https://mega.nz/file/GQFQgQxa#JakeflmZOqNGTENpwpKT2DBOWxO1azc6dqA2xf3W3Vs"
  },
  {
    "number": 25,
    "name": "Stardew Valley: Expanded & SVE-Ready (Ultra Compressed)",
    "description": "The complete farming RPG masterpiece compressed to just 40% of its original size without sacrificing content. This repack includes: version 1.5.6 with all updates, the Stardew Valley Expanded mod pre-installed (50+ new characters/locations), and 20 quality-of-life mods (automation, UI improvements). Configuration wizard lets you choose between: vanilla experience, moderate expansion (SVE), or hardcore 'Ridgeside Village' integration. Technical features: RAM optimization for low-end PCs, save file migration from Steam/GOG versions, and a mod manager for easily adding content like 'East Scarp.' Perfect for newcomers or veterans wanting to rediscover Pelican Town with fresh storylines and marriage candidates.",
    "link": "https://mega.nz/file/ZMo30AQA#jJ3U--3OaPyt1QoEJ_w88ogbSeI1qenmGZ-sC9SVbKc"
  },
  {
    "number": 24,
    "name": "Katana ZERO: Neon Noir Edition (Compressed Repack)",
    "description": "The award-winning action platformer in a razor-sharp 800MB package (original: 3GB). Features: the complete main story with multiple endings, alternate soundtrack DLC, and speedrun mode. This repack optimizes the game's pixel art without quality loss using custom LZSS compression for the animation frames. Includes community-made patches: New Game+ with remixed enemy layouts, boss rush mode, and the controversial 'Dragon' difficulty setting. The portable version runs on anything from Windows 7 to Steam Deck, with controller rumble support and adjustable CRT scanline effects for that authentic 80s VHS aesthetic.",
    "link": "https://mega.nz/file/tcwkQCYI#yjS0Rw1t7n8wEi9Sn7ZehxIHS3zonB55I2-iPt1MTl8"
  },
  {
    "number": 23,
    "name": "Undertale: Pacifist/Genocide Dual Mode (Tiny Repack)",
    "description": "Toby Fox's indie masterpiece compressed to a mere 120MB while preserving every pixel of its charm. This special edition lets you toggle between Pacifist and Genocide routes at will—perfect for experiencing both storylines without replaying. Includes: the full 100+ track soundtrack, Dog Shrine secrets, and the mysterious 'Hard Mode' accessible only through file manipulation. The repack uses LZMA compression for faster loading than the original, with optional settings for: 4K upscaling (via shaders), variable bullet-hell difficulty, and a built-in alarm that warns when you've triggered Genocide flags. Runs on potatoes—tested on a Raspberry Pi 400!",
    "link": "https://mega.nz/file/8AwmDJab#u3tRIXeHRZF1Kt5b_4XLs4AQw1_wV2Xpu_4ow7OVb64"
  },
  {
    "number": 22,
    "name": "GTA San Andreas: Definitive Modded Edition (Compressed)",
    "description": "Rockstar's open-world classic reborn in an 800MB repack with modern enhancements. This version includes: widescreen support (up to 21:9), draw distance fixes, and the essential 'SilentPatch' for Windows 10/11 compatibility. Pre-installed mods: realistic car physics, HD weapon textures, and the 'Grove Street Families' storyline expansion. The compressed package retains all original content—three cities, 100+ missions, and the legendary soundtrack (though radio stations now stream via external MP3 folder). Includes a mod manager for easily adding: ENB graphics, new interiors, or the controversial 'Hot Coffee' restoration. Perfect for nostalgic gamers or those discovering CJ's story for the first time.",
    "link": "https://mega.nz/file/dU4hnYjZ#LrzCT9TI4w5aCIyVbnecTyI9H5Q0I2mMJRwGE8irqfo"
  },
  {
    "number": 21,
    "name": "Height Maxxing: The Scientific Growth Protocol (2024 Edition)",
    "description": "The most comprehensive guide to height optimization ever compiled—150 pages of evidence-based techniques. Covers: micronutrient protocols (Vitamin D3/K2 synergies), low-intensity spinal decompression routines, and growth plate stimulation via pulsed electromagnetic fields (PEMF). Includes: 12-month workout plans with progress tracking, meal plans optimized for IGF-1 production, and sleep optimization hacks to maximize growth hormone secretion. The PDF features interactive elements: a genetic potential calculator (based on parental heights), supplement dosage planner, and 3D spinal alignment visualizers. Controversial but effective—includes the 'Swedish Growth Protocol' used by European endocrinologists for late bloomers.",
    "link": "https://mega.nz/file/FcpgVD7L#TKEBlSaCLkFaV4xXnt9-kAuFXb2xmkdB49RyD3L9mcg"
  },
  {
    "number": 20,
    "name": "Perfect EQ: Studio-Grade Audio Preset (EasyEffects/Linux)",
    "description": "Transform your Linux audio with this professional-grade EasyEffects preset modeled after $10,000 studio monitors. The configuration achieves: Harman target curve accuracy (±2dB from 20Hz-20kHz), 3kHz vocal clarity boost for podcasts, and sub-bass extension (+6dB at 40Hz) without distortion. Includes profiles for: Sennheiser HD600 (reference neutral), Beyerdynamic DT990 (bright treble correction), and Kali LP-6 studio monitors. Technical features: multiband dynamic EQ to prevent clipping, advanced room correction algorithms, and A/B testing between 7 signature sound profiles (from 'Analytical' to 'Cinematic Bass'). Comes with calibration instructions using pink noise generators and a USB measurement mic.",
    "link": "https://mega.nz/file/lUQVQIKB#OwGQNBZd_Fk3kSwQ_ohwKDuyxJuKPDl0HsGhZlWxHMw"
  },
  {
    "number": 19,
    "name": "Dolby Atmos Home Theater Emulation (EasyEffects Preset)",
    "description": "Experience true surround sound from stereo headphones or speakers with this Dolby Atmos-inspired EasyEffects preset. The configuration uses: HRTF (head-related transfer function) binaural processing, midrange scoop (700Hz dip) for dialogue clarity, and dynamic range compression matching commercial cinema standards. Includes 3 modes: 'Theater' (reference Atmos curve), 'Night' (reduced sub-bass for apartments), and 'Dialog Boost' (+4dB center channel emulation). Advanced features: automatic loudness normalization for consistent volume across media, transient enhancer for punchier action scenes, and a 'Virtual Height' algorithm that simulates overhead channels. Configuration guide covers tuning for: small desktop setups, living room TVs, and car audio systems.",
    "link": "https://mega.nz/file/wU51WYbJ#k3q97oVcyQwkdY7PvqOm4ogVOUyyixxyoL_Xy5WHoBg"
  },
  {
    "number": 18,
    "name": "Bass Booster: Physics-Based Enhancement (EasyEffects)",
    "description": "An intelligent bass boosting preset that avoids muddy distortion through psychoacoustic principles. Unlike crude EQ boosts, this configuration uses: harmonic excitation to create the illusion of deeper bass, dynamic EQ that automatically reduces low-end during dense musical passages, and a subharmonic synthesizer for frequencies below your headphones' physical limits. Customizable parameters: from subtle (+3dB 'Hip-Hop' profile) to extreme (+15dB 'Dubstep' mode with midrange ducking). Includes protection settings for: planar magnetic drivers (prevent over-excursion), cheap earbuds (low-pass safety cutoff), and studio monitors (DC offset prevention). Works miracles with classical music and podcasts too—try the 'Baroque Organ' preset for 32-foot pipe organ emulation!",
    "link": "https://mega.nz/file/hRgyVKKT#xeM-0BjgLMpPphE5-MaC4RNtNLYJ8qqQCpZmaH7KLSo"
  },
  {
    "number": 17,
    "name": "Zero to One: Silicon Valley's Innovation Bible (Annotated)",
    "description": "Peter Thiel's controversial startup manifesto with 50+ pages of new annotations from tech insiders. This edition includes: rebuttals to Thiel's monopoly theories from open-source advocates, case studies on how '0 to 1' principles fueled companies like SpaceX and Neuralink, and a critical analysis of Thiel's investment theses post-Trump. The PDF features: interactive 'Future Projection' exercises, embedded videos of Thiel's rare lectures at Stanford, and a 'Contrarian Idea Generator' tool. Bonus: The complete text of 'The Diversity Myth'—Thiel's out-of-print 1995 critique of multiculturalism at Stanford that foreshadowed his later philosophies.",
    "link": "https://mega.nz/file/ZcQyWbDS#_XT7NjWY7yiuoZmIaIYYx8yRZMJa2dpD402g8Bnp2-I"
  },
  {
    "number": 16,
    "name": "Steal Like an Artist: Creativity Unlocked (Interactive PDF)",
    "description": "Austin Kleon's bestselling guide to artistic theft in a multimedia-enhanced edition. Beyond the original book's content, this version includes: interactive 'Influence Maps' showing connections between historical artists, video tutorials on Kleon's newspaper blackout poetry technique, and a digital collage maker with 100+ public domain images to remix. The PDF features: clickable references to Creative Commons archives, an 'Anxiety Destroyer' flowchart for creative blocks, and printable templates for Kleon's famous 'Analog Twitter' journaling system. Perfect for: designers suffering impostor syndrome, writers battling blank page terror, or anyone seeking to build a creative practice through strategic plagiarism.",
    "link": "https://mega.nz/file/FNwGHJKZ#r9X1RkfbaDfH7pXLZWU0pIM5GlPHBNrarNuRS5cVzgk"
  },
  {
    "number": 15,
    "name": "The Psychology of Money: Timeless Wealth Principles (2024 Update)",
    "description": "Morgan Housel's finance classic updated with post-pandemic case studies on Bitcoin, meme stocks, and inflation psychology. This edition adds: 3 new chapters ('The Vaccinated Investor,' 'TikTok Trading,' and 'ZIRP Hangover'), behavioral analysis of the 2022 crypto crash, and interviews with survivors of the Great Depression. Interactive features: a compound interest calculator with historical market scenarios, a 'Financial PTSD' self-assessment, and animated versions of Housel's famous wealth-building parables. Includes the controversial 'Doomsday Portfolio' appendix—a hedge fund manager's guide to preserving wealth during social collapse.",
    "link": "https://mega.nz/file/wUAEADiA#E1ck3uOKM-qfZw0Lr-hRTfxlFnEFyu-ykbg_VLLzock"
  },
  {
    "number": 14,
    "name": "Arch Linux: The Expert's Handbook (2024 Edition)",
    "description": "The most comprehensive Arch Linux guide available—now updated for kernel 6.8 and systemd 255. This 300-page manual covers: secure boot with self-signed keys, Btrfs snapshots with Timeshift integration, and performance tuning for AMD Ryzen/Intel Raptor Lake. Advanced topics: creating custom PKGBUILDs with -march=native optimizations, GPU passthrough for gaming VMs, and forensic recovery of failed installations. The PDF includes: troubleshooting flowcharts for common issues (WiFi not working after suspend), printable cheat sheets for pacman commands, and a 'Rice Gallery' showcasing 20+ desktop environments from minimal dwm to KDE Plasma 6. Essential for anyone serious about Linux mastery.",
    "link": "https://mega.nz/file/pRRliBgS#SxL7ngN7zKeM8V793OKe7ceKMJ_YbF5u5LG3AAv3D-k"
  },
  {
    "number": 13,
    "name": "Linux Administration: The Black Belt Course (PDF + Labs)",
    "description": "A 450-page sysadmin bible covering everything from basic Bash scripting to Kubernetes cluster management. Structured as a 12-week course with hands-on labs: set up a full LAMP stack using only CLI, create custom RPM/Deb packages, and simulate a DDoS attack to practice iptables hardening. Special sections: forensic analysis with The Sleuth Kit, writing systemd services for legacy daemons, and cross-compiling kernels for embedded devices. The PDF features: answer keys for all exercises, video walkthroughs of complex topics (LDAP integration), and an 'Emergency Toolkit'—bootable USB image with all scripts from the book. Certification aligned: covers 90% of RHCSA and LPIC-3 exam objectives.",
    "link": "https://mega.nz/file/8RZXhTBC#IVh9K9wtZuow6c8dw9JGGkPJOclW06wA90B-7StIRRA"
  },
  {
    "number": 12,
    "name": "TLauncher: Ultimate Minecraft Bundle (Linux Optimized)",
    "description": "The complete Minecraft Java experience for Linux gamers in one click. This preconfigured bundle includes: TLauncher with modpack auto-download (FTB, RLcraft), Zulu JDK 17 optimized for AMD/NVIDIA, and performance mods pre-installed (Sodium, Lithium, Starlight). Special features: AUR update notifier, Steam Deck controller configs, and a bash script that converts Windows modpacks to Linux compatibility. Also includes: 20+ popular shaders (Complementary Reimagined), a texture pack manager, and the controversial 'OptiFine Legacy' for older mods. First-run wizard helps choose between: vanilla purist setup, hardcore modded (300+ mods), or technical Minecraft (Create mod + redstone helpers).",
    "link": "https://mega.nz/file/tNIyzSzY#d2-3jGLpiyCTB0D1EWJnR00givowd1s0jWJtkXsAZpM"
  },
  {
    "number": 11,
    "name": "The Art of Invisibility: Digital Privacy Masterclass (Kevin Mitnick)",
    "description": "The world's most famous hacker teaches advanced anonymity techniques in this expanded edition. Covers: burner device protocols using Raspberry Pi, defeating gait recognition with shoe modifications, and creating 'legend' backstories for deep cover identities. New 2024 content: AI voice cloning prevention, quantum-resistant encryption methods, and a chapter on 'Adversarial T-Shirts' that fool facial recognition. The PDF includes: printable OPSEC checklists, links to active Tor hidden services for secure tools, and Mitnick's famous 'Social Engineering Red Flags' quiz. Warning: Some techniques described are illegal in certain jurisdictions—provided for educational purposes only.",
    "link": "https://mega.nz/file/gBxgmZ4Y#_fEaXReV1ApJr8Fxwsepe1wUEvWBJCw4UAcuEUNWT_M"
  },
  {
    "number": 10,
    "name": "Metasploit: The Penetration Tester's Bible (2024 Edition)",
    "description": "The most current Metasploit Framework guide available, updated for version 6.3. This 600-page manual covers: cloud exploitation (AWS Lambda persistence), IoT device hacking (RouterSploit integration), and advanced evasion techniques (AMSI bypass via Reflective DLL injection). Hands-on labs include: building a custom C2 framework atop Metasploit, conducting purple team exercises, and writing post-exploitation modules for Windows 11. The PDF features: interactive exploit development workflows, video demonstrations of complex attacks, and a 'Vulnerability Researcher's Toolkit' with 50+ pre-built fuzzers. Ethical hackers only—includes responsible disclosure templates and legal guidelines.",
    "link": "https://mega.nz/file/dUg2VagZ#xL7XS8FnmYnWwsapOvR256U6LEibDQxW8NRwdisdU5I"
  },
  {
    "number": 9,
    "name": "Black Hat Python: Offensive Programming Cookbook (Python 3.11)",
    "description": "Justin Seitz's hacker's cookbook completely updated for modern Python. Learn: process injection via PEP 523 hooks, TLS interception with asyncio, and malware persistence through Discord webhooks. New chapters cover: exploiting serverless architectures (AWS Lambda backdoors), bypassing EDR solutions using PyInstaller obscure features, and automating vulnerability research with GPT-4 integration. The PDF includes: 200+ ready-to-use scripts, Jupyter notebooks for attack simulation, and a 'Malware Factory' that automatically obfuscates your payloads. Bonus: Interviews with APT programmers on their Python toolchains and the rise of 'Python-as-a-backdoor' in supply chain attacks.",
    "link": "https://mega.nz/file/gVw10IyQ#TKbEGEmR0DsxlxLGMDj9lbZKN5dG9_hZe-WC0mGRU0U"
  },
  {
    "number": 8,
    "name": "Hacking: The Art of Exploitation (Interactive 2024 Edition)",
    "description": "Jon Erickson's classic now with interactive exploit simulations. This edition adds: RISC-V assembly tutorials, WebAssembly exploitation labs, and a virtual machine with 50+ deliberately vulnerable binaries. The PDF integrates with Radare2/WinDbg for real-time debugging exercises—click any assembly listing to see it execute step-by-step. New content: kernel-mode rootkits for Linux 6.x, Return-Oriented Programming on ARM64, and exploiting memory-safe language implementations (Rust CVEs). Includes a 'Cyber Range' with capture-the-flag challenges that automatically grade your solutions. Perfect for OSCP prep or understanding how nation-state exploits work at the binary level.",
    "link": "https://mega.nz/file/UIxyzI4a#5SwBDWl2j9JwYcNNpabRUSf9tZshUsOhZxxXIjR4_vc"
  },
  {
    "number": 7,
    "name": "HappyMod Premium (Ad-Free Modded APK Store v3.1.5)",
    "description": "The controversial Android app store specializing in modded APKs, now with ads removed and certificate patching pre-applied. Features: 50,000+ modified apps/games (premium features unlocked, infinite in-game currency), delta updates to reduce data usage, and a community voting system to detect malware. This version includes: a built-in virtual environment to test apps safely, automatic APK signature spoofing for rootless installation, and a 'Stealth Mode' that hides the app from Google Play Protect. Warning: Using modded APKs may violate terms of service—includes guidelines for 'legitimate' uses like testing app behavior before purchase. Not recommended for banking devices.",
    "link": "https://mega.nz/file/tU5CXbyQ#HbecF18H-kszMtPz8CqXBc8t6QVCgyLvk1qSWOxeE44"
  },
  {
    "number": 6,
    "name": "Minecraft Bedrock v1.21.80.28 (Tricky Trials Update)",
    "description": "The official Minecraft Bedrock APK featuring the massive 'Tricky Trials' update. New content: trial chambers with complex redstone puzzles, the breeze mob that manipulates wind currents, and the deadly mace weapon with smash attack physics. This clean, unmodified APK includes: Xbox Live multiplayer support, all marketplace items (when purchased), and Chromebook compatibility. Technical improvements: Vulkan renderer for Snapdragon devices, reduced RAM usage on low-end Android phones, and proper controller support for Backbone/GameSir. SHA-256 verified against Mojang's servers—perfect for users who want official updates without waiting for store approvals.",
    "link": "https://mega.nz/file/gN5GzbiQ#UDq5OZwLFmCLsdTywcJxaNlvb-I-vqtuNAqoVLFPPSY"
  },
  {
    "number": 5,
    "name": "Minecraft Bedrock v1.21.72 (Stable Pre-Trials Version)",
    "description": "A preserved 'golden version' of Minecraft Bedrock before the Tricky Trials changes, ideal for players experiencing bugs in newer releases. Includes: the crafter block automation system, armor trim customization, and the controversial 'bundles' item that was later removed. This APK is optimized for: older Android devices (runs smoothly on 2GB RAM), education edition users needing stability, and modders working with pre-1.21.80 add-ons. Multiplayer compatible with: Windows 10/11, iOS, and Xbox consoles. Special feature: Includes the deprecated 'Minecraft for Fire OS' binaries for Kindle Fire users abandoned by Amazon.",
    "link": "https://mega.nz/file/kRhhCJQY#eRy6BO8rT4JkAIqiJL66MIc5ecA0i6KkXr_CEZnheu0"
  },
  {
    "number": 4,
    "name": "Block Blast! Adventure Master Mod (Unlimited Money v6.8.7)",
    "description": "The popular puzzle game with all premium features unlocked—infinite coins, ad-free experience, and all 500+ puzzle packs accessible from the start. This mod uses: JNI tampering to bypass license checks, memory editing to prevent currency deduction, and signature spoofing to allow installation alongside the Play Store version. Includes: the 'Mystery Island' DLC maps, all seasonal event content permanently unlocked, and a 'Zen Mode' that removes move limits. Safety features: no root required, network permission removed to prevent detection, and a toggle to restore IAPs if you later want to support developers. Use responsibly!",
    "link": "https://mega.nz/file/NMwDVBKQ#UEerI1rYtrkBTnIsRHyajIcw-Rh8yFV3LJLrh3A_rdI"
  },
  {
    "number": 3,
    "name": "Guide to Computer Forensics (5th Ed. + Case Files)",
    "description": "The standard textbook for digital forensics now with 50GB of real-world case files. Covers: MacOS Unified Logs analysis, decrypting Bitcoin wallets from RAM captures, and extracting data from Tesla's infotainment systems. The enhanced PDF includes: interactive timelines of famous cybercrime cases (from Mt. Gox to Colonial Pipeline), video walkthroughs of autopsy analyses, and a 'Virtual Crime Lab' with pre-configured Autopsy/Sleuth Kit instances. New chapters address: iOS 16-17 forensic acquisition methods, analyzing neural network-generated deepfakes, and the emerging field of 'IoT Device Autopsies' for smart home crime scenes.",
    "link": "https://mega.nz/file/hdJTCL4L#CorKjy7D-OsBUowEyJc615BkCvBOQzh_EDG9F364QLo"
  },
  {
    "number": 2,
    "name": "Visual Studio Code Portable (Dev Environment in a Box)",
    "description": "A fully configured VSCode environment that runs from USB without installation. Includes: pre-installed extensions (GitLens, Docker, Jupyter), optimized settings.json for web development (ESLint auto-fix on save), and portable versions of Python/Node.js. Special features: integrated Windows Subsystem for Linux (Ubuntu 22.04), a 'Lecture Mode' that slows down typing for streaming/teaching, and AI pair programmers (GitHub Copilot alternative). The package auto-detects project types—opening a Java folder activates Spring Tools while Python projects get PyCharm keybindings. Perfect for coding bootcamps or maintaining consistent environments across machines.",
    "link": "https://mega.nz/file/VNJFBALJ#tX6y1k35x7XMLPEjsOEKQGNsawv-O5wB0vhF22F20Zw"
  },
  {
    "number": 1,
    "name": "7-Zip Portable (Ultimate Compression Toolkit)",
    "description": "The open-source archiving powerhouse in a portable executable that runs anywhere—no admin rights needed. This enhanced version includes: context menu integration (optional), benchmark tools for comparing compression methods, and scripts to automate multi-volume encrypted backups. Supports 87 formats: from standard ZIP/RAR to exotic ones like QCOW2 virtual disks and Nintendo ROM files. Advanced features: hardware-accelerated LZMA2 compression (AVX2/ARMv8 optimized), pre-configured profiles for maximum ratio (ZSTD 22) vs speed (LZ4), and a 'Paranoid Mode' that verifies archives with SHA-256 after creation. The only tool you'll need to handle everything from simple extractions to forensic-grade data preservation.",
    "link": "https://mega.nz/file/ZNBhwChS#xwsigc63qS7FfUnhsRIOu05i3JsKh300VrvZmL5hyBc"
  },
  {
    "number": 999,
    "name": "Easter egg",
    "description": "Congrats, you find a easter egg!!, well... just this... you can go (Click download)",
    "link": "https://www.youtube.com/watch?v=xvFZjo5PgG0"
  }
]